Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV70_DFP/4.0.19/samv70/edc/ATSAMV70Q19.PIC
      <edc:SFRDef edc:_addr="0x4001C0E8" edc:access="rrrrrrrrrrrrrrrrrrrrrrrr-------r" edc:cname="TWIHS1_WPSR" edc:impl="0xFFFFFF01" edc:nzwidth="0x20" ltx:memberofperipheral="TWIHS1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TWIHS1">
            <edc:SFRFieldDef edc:cname="WPVS" edc:desc="Write Protection Violation Status" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="WPVSRC" edc:desc="Write Protection Violation Source" edc:nzwidth="0x18"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x4001C0EC" edc:offset="0x3F14"/>
      <edc:SFRDef edc:_addr="0x40020000" edc:access="----nnnnnnnnnnnn----nnnnnnnnnnnn" edc:cname="PWM0_CLK" edc:impl="0xFFF0FFF" edc:nzwidth="0x20" ltx:memberofperipheral="PWM0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM0">
            <edc:SFRFieldDef edc:cname="DIVA" edc:desc="CLKA Divide Factor" edc:nzwidth="0x8">
              <edc:SFRFieldSemantic edc:cname="CLKA_POFF" edc:desc="CLKA clock is turned off" edc:when="(field &amp; 0xFF) == 0"/>
              <edc:SFRFieldSemantic edc:cname="PREA" edc:desc="CLKA clock is clock selected by PREA" edc:when="(field &amp; 0xFF) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="PREA" edc:desc="CLKA Source Clock Selection" edc:nzwidth="0x4">
              <edc:SFRFieldSemantic edc:cname="CLK" edc:desc="Peripheral clock" edc:when="(field &amp; 0xF) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="CLK_DIV2" edc:desc="Peripheral clock/2" edc:when="(field &amp; 0xF) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="CLK_DIV4" edc:desc="Peripheral clock/4" edc:when="(field &amp; 0xF) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="CLK_DIV8" edc:desc="Peripheral clock/8" edc:when="(field &amp; 0xF) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="CLK_DIV16" edc:desc="Peripheral clock/16" edc:when="(field &amp; 0xF) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="CLK_DIV32" edc:desc="Peripheral clock/32" edc:when="(field &amp; 0xF) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="CLK_DIV64" edc:desc="Peripheral clock/64" edc:when="(field &amp; 0xF) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="CLK_DIV128" edc:desc="Peripheral clock/128" edc:when="(field &amp; 0xF) == 0x7"/>
              <edc:SFRFieldSemantic edc:cname="CLK_DIV256" edc:desc="Peripheral clock/256" edc:when="(field &amp; 0xF) == 0x8"/>
              <edc:SFRFieldSemantic edc:cname="CLK_DIV512" edc:desc="Peripheral clock/512" edc:when="(field &amp; 0xF) == 0x9"/>
              <edc:SFRFieldSemantic edc:cname="CLK_DIV1024" edc:desc="Peripheral clock/1024" edc:when="(field &amp; 0xF) == 0xA"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="DIVB" edc:desc="CLKB Divide Factor" edc:nzwidth="0x8">
              <edc:SFRFieldSemantic edc:cname="CLKB_POFF" edc:desc="CLKB clock is turned off" edc:when="(field &amp; 0xFF) == 0"/>
              <edc:SFRFieldSemantic edc:cname="PREB" edc:desc="CLKB clock is clock selected by PREB" edc:when="(field &amp; 0xFF) == 1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="PREB" edc:desc="CLKB Source Clock Selection" edc:nzwidth="0x4">
              <edc:SFRFieldSemantic edc:cname="CLK" edc:desc="Peripheral clock" edc:when="(field &amp; 0xF) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="CLK_DIV2" edc:desc="Peripheral clock/2" edc:when="(field &amp; 0xF) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="CLK_DIV4" edc:desc="Peripheral clock/4" edc:when="(field &amp; 0xF) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="CLK_DIV8" edc:desc="Peripheral clock/8" edc:when="(field &amp; 0xF) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="CLK_DIV16" edc:desc="Peripheral clock/16" edc:when="(field &amp; 0xF) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="CLK_DIV32" edc:desc="Peripheral clock/32" edc:when="(field &amp; 0xF) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="CLK_DIV64" edc:desc="Peripheral clock/64" edc:when="(field &amp; 0xF) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="CLK_DIV128" edc:desc="Peripheral clock/128" edc:when="(field &amp; 0xF) == 0x7"/>
              <edc:SFRFieldSemantic edc:cname="CLK_DIV256" edc:desc="Peripheral clock/256" edc:when="(field &amp; 0xF) == 0x8"/>
              <edc:SFRFieldSemantic edc:cname="CLK_DIV512" edc:desc="Peripheral clock/512" edc:when="(field &amp; 0xF) == 0x9"/>
              <edc:SFRFieldSemantic edc:cname="CLK_DIV1024" edc:desc="Peripheral clock/1024" edc:when="(field &amp; 0xF) == 0xA"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40020004" edc:access="----------------------------wwww" edc:cname="PWM0_ENA" edc:impl="0xF" edc:nzwidth="0x20" ltx:memberofperipheral="PWM0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM0">
            <edc:SFRFieldDef edc:cname="CHID0" edc:desc="Channel ID" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHID1" edc:desc="Channel ID" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHID2" edc:desc="Channel ID" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHID3" edc:desc="Channel ID" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40020008" edc:access="----------------------------wwww" edc:cname="PWM0_DIS" edc:impl="0xF" edc:nzwidth="0x20" ltx:memberofperipheral="PWM0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM0">
            <edc:SFRFieldDef edc:cname="CHID0" edc:desc="Channel ID" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHID1" edc:desc="Channel ID" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHID2" edc:desc="Channel ID" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHID3" edc:desc="Channel ID" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4002000C" edc:access="----------------------------rrrr" edc:cname="PWM0_SR" edc:impl="0xF" edc:nzwidth="0x20" ltx:memberofperipheral="PWM0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM0">
            <edc:SFRFieldDef edc:cname="CHID0" edc:desc="Channel ID" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHID1" edc:desc="Channel ID" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHID2" edc:desc="Channel ID" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHID3" edc:desc="Channel ID" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40020010" edc:access="------------wwww------------wwww" edc:cname="PWM0_IER1" edc:impl="0xF000F" edc:nzwidth="0x20" ltx:memberofperipheral="PWM0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM0">
            <edc:SFRFieldDef edc:cname="CHID0" edc:desc="Counter Event on Channel 0 Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHID1" edc:desc="Counter Event on Channel 1 Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHID2" edc:desc="Counter Event on Channel 2 Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHID3" edc:desc="Counter Event on Channel 3 Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0xC"/>
            <edc:SFRFieldDef edc:cname="FCHID0" edc:desc="Fault Protection Trigger on Channel 0 Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FCHID1" edc:desc="Fault Protection Trigger on Channel 1 Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FCHID2" edc:desc="Fault Protection Trigger on Channel 2 Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FCHID3" edc:desc="Fault Protection Trigger on Channel 3 Interrupt Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40020014" edc:access="------------wwww------------wwww" edc:cname="PWM0_IDR1" edc:impl="0xF000F" edc:nzwidth="0x20" ltx:memberofperipheral="PWM0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM0">
            <edc:SFRFieldDef edc:cname="CHID0" edc:desc="Counter Event on Channel 0 Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHID1" edc:desc="Counter Event on Channel 1 Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHID2" edc:desc="Counter Event on Channel 2 Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHID3" edc:desc="Counter Event on Channel 3 Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0xC"/>
            <edc:SFRFieldDef edc:cname="FCHID0" edc:desc="Fault Protection Trigger on Channel 0 Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FCHID1" edc:desc="Fault Protection Trigger on Channel 1 Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FCHID2" edc:desc="Fault Protection Trigger on Channel 2 Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FCHID3" edc:desc="Fault Protection Trigger on Channel 3 Interrupt Disable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
