Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV70_DFP/4.0.19/samv70/edc/ATSAMV70Q19.PIC
      <edc:SFRDef edc:_addr="0x4002800C" edc:access="-------w----wwww--w--wwwwww--www" edc:cname="US_IDR" edc:impl="0x10F27E7" edc:nzwidth="0x20" ltx:memberofperipheral="USART1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USART1">
            <edc:SFRFieldDef edc:cname="RXRDY" edc:desc="RXRDY Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXRDY" edc:desc="TXRDY Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXBRK" edc:desc="Receiver Break Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="OVRE" edc:desc="Overrun Error Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FRAME" edc:desc="Framing Error Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PARE" edc:desc="Parity Error Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TIMEOUT" edc:desc="Timeout Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXEMPTY" edc:desc="TXEMPTY Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ITER" edc:desc="Max Number of Repetitions Reached Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="NACK" edc:desc="Non Acknowledge Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="RIIC" edc:desc="Ring Indicator Input Change Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DSRIC" edc:desc="Data Set Ready Input Change Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DCDIC" edc:desc="Data Carrier Detect Input Change Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CTSIC" edc:desc="Clear to Send Input Change Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="MANE" edc:desc="Manchester Error Interrupt Disable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40028010" edc:access="-------r----rrrr--r--rrrrrr--rrr" edc:cname="US_IMR" edc:impl="0x10F27E7" edc:nzwidth="0x20" ltx:memberofperipheral="USART1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USART1">
            <edc:SFRFieldDef edc:cname="RXRDY" edc:desc="RXRDY Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXRDY" edc:desc="TXRDY Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXBRK" edc:desc="Receiver Break Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="OVRE" edc:desc="Overrun Error Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FRAME" edc:desc="Framing Error Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PARE" edc:desc="Parity Error Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TIMEOUT" edc:desc="Timeout Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXEMPTY" edc:desc="TXEMPTY Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ITER" edc:desc="Max Number of Repetitions Reached Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="NACK" edc:desc="Non Acknowledge Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="RIIC" edc:desc="Ring Indicator Input Change Mask" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DSRIC" edc:desc="Data Set Ready Input Change Mask" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DCDIC" edc:desc="Data Carrier Detect Input Change Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CTSIC" edc:desc="Clear to Send Input Change Interrupt Mask" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="MANE" edc:desc="Manchester Error Interrupt Mask" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40028014" edc:access="-------rrrrrrrrr--r--rrrrrr--rrr" edc:cname="US_CSR" edc:impl="0x1FF27E7" edc:nzwidth="0x20" ltx:memberofperipheral="USART1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USART1">
            <edc:SFRFieldDef edc:cname="RXRDY" edc:desc="Receiver Ready (cleared by reading US_RHR)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXRDY" edc:desc="Transmitter Ready (cleared by writing US_THR)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXBRK" edc:desc="Break Received/End of Break (cleared by writing a one to bit US_CR.RSTSTA)" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="OVRE" edc:desc="Overrun Error (cleared by writing a one to bit US_CR.RSTSTA)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FRAME" edc:desc="Framing Error (cleared by writing a one to bit US_CR.RSTSTA)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PARE" edc:desc="Parity Error (cleared by writing a one to bit US_CR.RSTSTA)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TIMEOUT" edc:desc="Receiver Timeout (cleared by writing a one to bit US_CR.STTTO)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXEMPTY" edc:desc="Transmitter Empty (cleared by writing US_THR)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ITER" edc:desc="Max Number of Repetitions Reached (cleared by writing a one to bit US_CR.RSTIT)" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="NACK" edc:desc="Non Acknowledge Interrupt (cleared by writing a one to bit US_CR.RSTNACK)" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="RIIC" edc:desc="Ring Indicator Input Change Flag (cleared on read)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DSRIC" edc:desc="Data Set Ready Input Change Flag (cleared on read)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DCDIC" edc:desc="Data Carrier Detect Input Change Flag (cleared on read)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CTSIC" edc:desc="Clear to Send Input Change Flag (cleared on read)" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RI" edc:desc="Image of RI Input" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DSR" edc:desc="Image of DSR Input" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DCD" edc:desc="Image of DCD Input" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CTS" edc:desc="Image of CTS Input" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MANERR" edc:desc="Manchester Error (cleared by writing a one to the bit US_CR.RSTSTA)" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40028018" edc:access="----------------r------rrrrrrrrr" edc:cname="US_RHR" edc:impl="0x81FF" edc:nzwidth="0x20" ltx:memberofperipheral="USART1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USART1">
            <edc:SFRFieldDef edc:cname="RXCHR" edc:desc="Received Character" edc:nzwidth="0x9"/>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="RXSYNH" edc:desc="Received Sync" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4002801C" edc:access="----------------w------wwwwwwwww" edc:cname="US_THR" edc:impl="0x81FF" edc:nzwidth="0x20" ltx:memberofperipheral="USART1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USART1">
            <edc:SFRFieldDef edc:cname="TXCHR" edc:desc="Character to be Transmitted" edc:nzwidth="0x9"/>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:SFRFieldDef edc:cname="TXSYNH" edc:desc="Sync Field to be Transmitted" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
