Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV70_DFP/4.0.19/samv70/edc/ATSAMV70Q19.PIC
      <edc:AdjustPoint edc:_addr="0x4002C02C" edc:offset="0x14"/>
      <edc:SFRDef edc:_addr="0x4002C040" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="US_FIDI" edc:impl="0xFFFF" edc:nzwidth="0x20" ltx:memberofperipheral="USART2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USART2">
            <edc:SFRFieldDef edc:cname="FI_DI_RATIO" edc:desc="FI Over DI Ratio Value" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4002C044" edc:access="------------------------rrrrrrrr" edc:cname="US_NER" edc:impl="0xFF" edc:nzwidth="0x20" ltx:memberofperipheral="USART2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USART2">
            <edc:SFRFieldDef edc:cname="NB_ERRORS" edc:desc="Number of Errors" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x4002C048" edc:offset="0x4"/>
      <edc:SFRDef edc:_addr="0x4002C04C" edc:access="------------------------nnnnnnnn" edc:cname="US_IF" edc:impl="0xFF" edc:nzwidth="0x20" ltx:memberofperipheral="USART2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USART2">
            <edc:SFRFieldDef edc:cname="IRDA_FILTER" edc:desc="IrDA Filter" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4002C050" edc:access="nnnn--nn----nnnn---n--nn----nnnn" edc:cname="US_MAN" edc:impl="0xF30F130F" edc:nzwidth="0x20" ltx:memberofperipheral="USART2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USART2">
            <edc:SFRFieldDef edc:cname="TX_PL" edc:desc="Transmitter Preamble Length" edc:nzwidth="0x4"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="TX_PP" edc:desc="Transmitter Preamble Pattern" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="ALL_ONE" edc:desc="The preamble is composed of '1's" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="ALL_ZERO" edc:desc="The preamble is composed of '0's" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="ZERO_ONE" edc:desc="The preamble is composed of '01's" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="ONE_ZERO" edc:desc="The preamble is composed of '10's" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="TX_MPOL" edc:desc="Transmitter Manchester Polarity" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="RX_PL" edc:desc="Receiver Preamble Length" edc:nzwidth="0x4"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="RX_PP" edc:desc="Receiver Preamble Pattern detected" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="ALL_ONE" edc:desc="The preamble is composed of '1's" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="ALL_ZERO" edc:desc="The preamble is composed of '0's" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="ZERO_ONE" edc:desc="The preamble is composed of '01's" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="ONE_ZERO" edc:desc="The preamble is composed of '10's" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="RX_MPOL" edc:desc="Receiver Manchester Polarity" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ONE" edc:desc="Must Be Set to 1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DRIFT" edc:desc="Drift Compensation" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXIDLEV" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4002C054" edc:access="--------------nnnnnnnnnnnnnnnnnn" edc:cname="US_LINMR" edc:impl="0x3FFFF" edc:nzwidth="0x20" ltx:memberofperipheral="USART2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USART2">
            <edc:SFRFieldDef edc:cname="NACT" edc:desc="LIN Node Action" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="PUBLISH" edc:desc="The USART transmits the response." edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="SUBSCRIBE" edc:desc="The USART receives the response." edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="IGNORE" edc:desc="The USART does not transmit and does not receive the response." edc:when="(field &amp; 0x3) == 0x2"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="PARDIS" edc:desc="Parity Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHKDIS" edc:desc="Checksum Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CHKTYP" edc:desc="Checksum Type" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DLM" edc:desc="Data Length Mode" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FSDIS" edc:desc="Frame Slot Mode Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WKUPTYP" edc:desc="Wakeup Signal Type" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DLC" edc:desc="Data Length Control" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="PDCM" edc:desc="DMAC Mode" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SYNCDIS" edc:desc="Synchronization Disable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4002C058" edc:access="------------------------nnnnnnnn" edc:cname="US_LINIR" edc:impl="0xFF" edc:nzwidth="0x20" ltx:memberofperipheral="USART2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="USART2">
            <edc:SFRFieldDef edc:cname="IDCHR" edc:desc="Identifier Character" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
