Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV70_DFP/4.0.19/samv70/edc/ATSAMV70Q19.PIC
      <edc:AdjustPoint edc:_addr="0x4005C0EC" edc:offset="0x44"/>
      <edc:SFRDef edc:_addr="0x4005C130" edc:access="-------nnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="PWM_CMP0PWM1_CMPV" edc:impl="0x1FFFFFF" edc:nzwidth="0x20" ltx:memberofperipheral="PWM1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM1">
            <edc:SFRFieldDef edc:cname="CV" edc:desc="Comparison x Value" edc:nzwidth="0x18"/>
            <edc:SFRFieldDef edc:cname="CVM" edc:desc="Comparison x Value Mode" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4005C134" edc:access="-------wwwwwwwwwwwwwwwwwwwwwwwww" edc:cname="PWM_CMP0PWM1_CMPVUPD" edc:impl="0x1FFFFFF" edc:nzwidth="0x20" ltx:memberofperipheral="PWM1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM1">
            <edc:SFRFieldDef edc:cname="CVUPD" edc:desc="Comparison x Value Update" edc:nzwidth="0x18"/>
            <edc:SFRFieldDef edc:cname="CVMUPD" edc:desc="Comparison x Value Mode Update" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4005C138" edc:access="--------nnnnnnnnnnnnnnnnnnnn---n" edc:cname="PWM_CMP0PWM1_CMPM" edc:impl="0xFFFFF1" edc:nzwidth="0x20" ltx:memberofperipheral="PWM1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM1">
            <edc:SFRFieldDef edc:cname="CEN" edc:desc="Comparison x Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="CTR" edc:desc="Comparison x Trigger" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="CPR" edc:desc="Comparison x Period" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="CPRCNT" edc:desc="Comparison x Period Counter" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="CUPR" edc:desc="Comparison x Update Period" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="CUPRCNT" edc:desc="Comparison x Update Period Counter" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4005C13C" edc:access="------------wwww----wwwwwwww---w" edc:cname="PWM_CMP0PWM1_CMPMUPD" edc:impl="0xF0FF1" edc:nzwidth="0x20" ltx:memberofperipheral="PWM1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM1">
            <edc:SFRFieldDef edc:cname="CENUPD" edc:desc="Comparison x Enable Update" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="CTRUPD" edc:desc="Comparison x Trigger Update" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="CPRUPD" edc:desc="Comparison x Period Update" edc:nzwidth="0x4"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="CUPRUPD" edc:desc="Comparison x Update Period Update" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4005C140" edc:access="-------nnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="PWM_CMP1PWM1_CMPV" edc:impl="0x1FFFFFF" edc:nzwidth="0x20" ltx:memberofperipheral="PWM1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM1">
            <edc:SFRFieldDef edc:cname="CV" edc:desc="Comparison x Value" edc:nzwidth="0x18"/>
            <edc:SFRFieldDef edc:cname="CVM" edc:desc="Comparison x Value Mode" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4005C144" edc:access="-------wwwwwwwwwwwwwwwwwwwwwwwww" edc:cname="PWM_CMP1PWM1_CMPVUPD" edc:impl="0x1FFFFFF" edc:nzwidth="0x20" ltx:memberofperipheral="PWM1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM1">
            <edc:SFRFieldDef edc:cname="CVUPD" edc:desc="Comparison x Value Update" edc:nzwidth="0x18"/>
            <edc:SFRFieldDef edc:cname="CVMUPD" edc:desc="Comparison x Value Mode Update" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4005C148" edc:access="--------nnnnnnnnnnnnnnnnnnnn---n" edc:cname="PWM_CMP1PWM1_CMPM" edc:impl="0xFFFFF1" edc:nzwidth="0x20" ltx:memberofperipheral="PWM1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM1">
            <edc:SFRFieldDef edc:cname="CEN" edc:desc="Comparison x Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="CTR" edc:desc="Comparison x Trigger" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="CPR" edc:desc="Comparison x Period" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="CPRCNT" edc:desc="Comparison x Period Counter" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="CUPR" edc:desc="Comparison x Update Period" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="CUPRCNT" edc:desc="Comparison x Update Period Counter" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4005C14C" edc:access="------------wwww----wwwwwwww---w" edc:cname="PWM_CMP1PWM1_CMPMUPD" edc:impl="0xF0FF1" edc:nzwidth="0x20" ltx:memberofperipheral="PWM1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PWM1">
            <edc:SFRFieldDef edc:cname="CENUPD" edc:desc="Comparison x Enable Update" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="CTRUPD" edc:desc="Comparison x Trigger Update" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="CPRUPD" edc:desc="Comparison x Period Update" edc:nzwidth="0x4"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="CUPRUPD" edc:desc="Comparison x Update Period Update" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
